/**
 * Тута будем хранить различные вспомогательные функции
 * создал: sherwud
 */
//----------------------------------------------------------------------------------------------------------------------
/**
 * функция  устанвливает значения куки
 * path :: string -> путь к проекту
 * callback :: function()
 */
function setCookie(path, callback) {
   $.ajax({
      type: 'POST',
      url: '/call/session/setDefaultProject',
      data: "path="+path+"&name="+$('#projectSelect').val(),
      success: callback
   });
}
//----------------------------------------------------------------------------------------------------------------------
